InDeviceMex/TM4C123/TM4C123_ACOMP/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
/********************************************************************************************/
/************************************* 10 SHPR2 ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_SHPR2_R_SVCALL_MASK    ((uint32_t) 0xE0000000UL)
#define SCB_SHPR2_R_SVCALL_BIT    (29UL)
#define SCB_SHPR2_R_SVCALL_PRI0    ((uint32_t) 0x00000000UL)
#define SCB_SHPR2_R_SVCALL_PRI1    ((uint32_t) 0x20000000UL)
#define SCB_SHPR2_R_SVCALL_PRI2    ((uint32_t) 0x40000000UL)
#define SCB_SHPR2_R_SVCALL_PRI3    ((uint32_t) 0x60000000UL)
#define SCB_SHPR2_R_SVCALL_PRI4    ((uint32_t) 0x80000000UL)
#define SCB_SHPR2_R_SVCALL_PRI5    ((uint32_t) 0xA0000000UL)
#define SCB_SHPR2_R_SVCALL_PRI6    ((uint32_t) 0xC0000000UL)
#define SCB_SHPR2_R_SVCALL_PRI7    ((uint32_t) 0xE0000000UL)

#define SCB_SHPR2_SVCALL_MASK    ((uint32_t) 0x00000007UL)
#define SCB_SHPR2_SVCALL_PRI0    ((uint32_t) 0x00000000UL)
#define SCB_SHPR2_SVCALL_PRI1    ((uint32_t) 0x00000001UL)
#define SCB_SHPR2_SVCALL_PRI2    ((uint32_t) 0x00000002UL)
#define SCB_SHPR2_SVCALL_PRI3    ((uint32_t) 0x00000003UL)
#define SCB_SHPR2_SVCALL_PRI4    ((uint32_t) 0x00000004UL)
#define SCB_SHPR2_SVCALL_PRI5    ((uint32_t) 0x00000005UL)
#define SCB_SHPR2_SVCALL_PRI6    ((uint32_t) 0x00000006UL)
#define SCB_SHPR2_SVCALL_PRI7    ((uint32_t) 0x00000007UL)
/*----------*/

/********************************************************************************************/
/************************************* 11 SHPR3 ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_SHPR3_R_DEBUG_MASK    ((uint32_t) 0x000000E0UL)
#define SCB_SHPR3_R_DEBUG_BIT    (5UL)
#define SCB_SHPR3_R_DEBUG_PRI0    ((uint32_t) 0x00000000UL)
#define SCB_SHPR3_R_DEBUG_PRI1    ((uint32_t) 0x00000020UL)
#define SCB_SHPR3_R_DEBUG_PRI2    ((uint32_t) 0x00000040UL)
#define SCB_SHPR3_R_DEBUG_PRI3    ((uint32_t) 0x00000060UL)
#define SCB_SHPR3_R_DEBUG_PRI4    ((uint32_t) 0x00000080UL)
#define SCB_SHPR3_R_DEBUG_PRI5    ((uint32_t) 0x000000A0UL)
#define SCB_SHPR3_R_DEBUG_PRI6    ((uint32_t) 0x000000C0UL)
#define SCB_SHPR3_R_DEBUG_PRI7    ((uint32_t) 0x000000E0UL)

#define SCB_SHPR3_DEBUG_MASK    ((uint32_t) 0x00000007UL)
#define SCB_SHPR3_DEBUG_PRI0    ((uint32_t) 0x00000000UL)
#define SCB_SHPR3_DEBUG_PRI1    ((uint32_t) 0x00000001UL)
#define SCB_SHPR3_DEBUG_PRI2    ((uint32_t) 0x00000002UL)
#define SCB_SHPR3_DEBUG_PRI3    ((uint32_t) 0x00000003UL)
#define SCB_SHPR3_DEBUG_PRI4    ((uint32_t) 0x00000004UL)
#define SCB_SHPR3_DEBUG_PRI5    ((uint32_t) 0x00000005UL)
#define SCB_SHPR3_DEBUG_PRI6    ((uint32_t) 0x00000006UL)
#define SCB_SHPR3_DEBUG_PRI7    ((uint32_t) 0x00000007UL)
/*----------*/

/*----------*/
#define SCB_SHPR3_R_PENDSV_MASK    ((uint32_t) 0x00E00000UL)
#define SCB_SHPR3_R_PENDSV_BIT    (21UL)
#define SCB_SHPR3_R_PENDSV_PRI0    ((uint32_t) 0x00000000UL)
#define SCB_SHPR3_R_PENDSV_PRI1    ((uint32_t) 0x00200000UL)
#define SCB_SHPR3_R_PENDSV_PRI2    ((uint32_t) 0x00400000UL)
#define SCB_SHPR3_R_PENDSV_PRI3    ((uint32_t) 0x00600000UL)
#define SCB_SHPR3_R_PENDSV_PRI4    ((uint32_t) 0x00800000UL)
#define SCB_SHPR3_R_PENDSV_PRI5    ((uint32_t) 0x00A00000UL)
#define SCB_SHPR3_R_PENDSV_PRI6    ((uint32_t) 0x00C00000UL)
#define SCB_SHPR3_R_PENDSV_PRI7    ((uint32_t) 0x00E00000UL)

#define SCB_SHPR3_PENDSV_MASK    ((uint32_t) 0x00000007UL)
#define SCB_SHPR3_PENDSV_PRI0    ((uint32_t) 0x00000000UL)
#define SCB_SHPR3_PENDSV_PRI1    ((uint32_t) 0x00000001UL)
#define SCB_SHPR3_PENDSV_PRI2    ((uint32_t) 0x00000002UL)
#define SCB_SHPR3_PENDSV_PRI3    ((uint32_t) 0x00000003UL)
#define SCB_SHPR3_PENDSV_PRI4    ((uint32_t) 0x00000004UL)
#define SCB_SHPR3_PENDSV_PRI5    ((uint32_t) 0x00000005UL)
#define SCB_SHPR3_PENDSV_PRI6    ((uint32_t) 0x00000006UL)
#define SCB_SHPR3_PENDSV_PRI7    ((uint32_t) 0x00000007UL)
/*----------*/

/*----------*/

#define SCB_SHPR3_R_SYSTICK_MASK    ((uint32_t) 0xE0000000UL)
#define SCB_SHPR3_R_SYSTICK_BIT    (29UL)
#define SCB_SHPR3_R_SYSTICK_PRI0    ((uint32_t) 0x00000000UL)
#define SCB_SHPR3_R_SYSTICK_PRI1    ((uint32_t) 0x20000000UL)
#define SCB_SHPR3_R_SYSTICK_PRI2    ((uint32_t) 0x40000000UL)
#define SCB_SHPR3_R_SYSTICK_PRI3    ((uint32_t) 0x60000000UL)
#define SCB_SHPR3_R_SYSTICK_PRI4    ((uint32_t) 0x80000000UL)
#define SCB_SHPR3_R_SYSTICK_PRI5    ((uint32_t) 0xA0000000UL)
#define SCB_SHPR3_R_SYSTICK_PRI6    ((uint32_t) 0xC0000000UL)
#define SCB_SHPR3_R_SYSTICK_PRI7    ((uint32_t) 0xE0000000UL)

#define SCB_SHPR3_SYSTICK_MASK    ((uint32_t) 0x00000007UL)
#define SCB_SHPR3_SYSTICK_PRI0    ((uint32_t) 0x00000000UL)
#define SCB_SHPR3_SYSTICK_PRI1    ((uint32_t) 0x00000001UL)
#define SCB_SHPR3_SYSTICK_PRI2    ((uint32_t) 0x00000002UL)
#define SCB_SHPR3_SYSTICK_PRI3    ((uint32_t) 0x00000003UL)
#define SCB_SHPR3_SYSTICK_PRI4    ((uint32_t) 0x00000004UL)
#define SCB_SHPR3_SYSTICK_PRI5    ((uint32_t) 0x00000005UL)
#define SCB_SHPR3_SYSTICK_PRI6    ((uint32_t) 0x00000006UL)
#define SCB_SHPR3_SYSTICK_PRI7    ((uint32_t) 0x00000007UL)
/*----------*/

/********************************************************************************************/
/************************************* 12 SHCSR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_SHCSR_R_MEMFAULTACT_MASK    ((uint32_t) 0x00000001UL)
#define SCB_SHCSR_R_MEMFAULTACT_BIT    (0UL)
#define SCB_SHCSR_R_MEMFAULTACT_NOACTIVE     ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_R_MEMFAULTACT_ACTIVE    ((uint32_t) 0x00000001UL)

#define SCB_SHCSR_MEMFAULTACT_MASK    ((uint32_t) 0x00000001UL)
#define SCB_SHCSR_MEMFAULTACT_NOACTIVE    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_MEMFAULTACT_ACTIVE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_BUSFAULTACT_MASK    ((uint32_t) 0x00000002UL)
#define SCB_SHCSR_R_BUSFAULTACT_BIT    (1UL)
#define SCB_SHCSR_R_BUSFAULTACT_NOACTIVE     ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_R_BUSFAULTACT_ACTIVE    ((uint32_t) 0x00000002UL)

