InDeviceMex/TM4C123/TM4C123_ACOMP/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_SHCSR_BUSFAULTACT_MASK    ((uint32_t) 0x00000001UL)
#define SCB_SHCSR_BUSFAULTACT_NOACTIVE    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_BUSFAULTACT_ACTIVE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_USGFAULTACT_MASK    ((uint32_t) 0x00000008UL)
#define SCB_SHCSR_R_USGFAULTACT_BIT    (3UL)
#define SCB_SHCSR_R_USGFAULTACT_NOACTIVE     ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_R_USGFAULTACT_ACTIVE    ((uint32_t) 0x00000008UL)

#define SCB_SHCSR_USGFAULTACT_MASK    ((uint32_t) 0x00000001UL)
#define SCB_SHCSR_USGFAULTACT_NOACTIVE    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_USGFAULTACT_ACTIVE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_SVCALLACT_MASK    ((uint32_t) 0x00000080UL)
#define SCB_SHCSR_R_SVCALLACT_BIT    (7UL)
#define SCB_SHCSR_R_SVCALLACT_NOACTIVE     ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_R_SVCALLACT_ACTIVE    ((uint32_t) 0x00000080UL)

#define SCB_SHCSR_SVCALLACT_MASK    ((uint32_t) 0x00000001UL)
#define SCB_SHCSR_SVCALLACT_NOACTIVE    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_SVCALLACT_ACTIVE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_MONITORACT_MASK    ((uint32_t) 0x00000100UL)
#define SCB_SHCSR_R_MONITORACT_BIT    (8UL)
#define SCB_SHCSR_R_MONITORACT_NOACTIVE     ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_R_MONITORACT_ACTIVE    ((uint32_t) 0x00000100UL)

#define SCB_SHCSR_MONITORACT_MASK    ((uint32_t) 0x00000001UL)
#define SCB_SHCSR_MONITORACT_NOACTIVE    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_MONITORACT_ACTIVE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_PENDSVACT_MASK    ((uint32_t) 0x00000400UL)
#define SCB_SHCSR_R_PENDSVACT_BIT    (10UL)
#define SCB_SHCSR_R_PENDSVACT_NOACTIVE     ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_R_PENDSVACT_ACTIVE    ((uint32_t) 0x00000400UL)

#define SCB_SHCSR_PENDSVACT_MASK    ((uint32_t) 0x00000001UL)
#define SCB_SHCSR_PENDSVACT_NOACTIVE    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_PENDSVACT_ACTIVE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_SYSTICKACT_MASK    ((uint32_t) 0x00000800UL)
#define SCB_SHCSR_R_SYSTICKACT_BIT    (11UL)
#define SCB_SHCSR_R_SYSTICKACT_NOACTIVE     ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_R_SYSTICKACT_ACTIVE    ((uint32_t) 0x00000800UL)

#define SCB_SHCSR_SYSTICKACT_MASK    ((uint32_t) 0x00000001UL)
#define SCB_SHCSR_SYSTICKACT_NOACTIVE    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_SYSTICKACT_ACTIVE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_USGFAULTPENDED_MASK    ((uint32_t) 0x00001000UL)
#define SCB_SHCSR_R_USGFAULTPENDED_BIT    (12UL)
#define SCB_SHCSR_R_USGFAULTPENDED_NOPEND    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_R_USGFAULTPENDED_PEND    ((uint32_t) 0x00001000UL)

#define SCB_SHCSR_USGFAULTPENDED_MASK    ((uint32_t) 0x00000001UL)
#define SCB_SHCSR_USGFAULTPENDED_NOPEND    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_USGFAULTPENDED_PEND    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_MEMFAULTPENDED_MASK    ((uint32_t) 0x00002000UL)
#define SCB_SHCSR_R_MEMFAULTPENDED_BIT    (13UL)
#define SCB_SHCSR_R_MEMFAULTPENDED_NOPEND    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_R_MEMFAULTPENDED_PEND    ((uint32_t) 0x00002000UL)

#define SCB_SHCSR_MEMFAULTPENDED_MASK    ((uint32_t) 0x00000001UL)
#define SCB_SHCSR_MEMFAULTPENDED_NOPEND    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_MEMFAULTPENDED_PEND    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_BUSFAULTPENDED_MASK    ((uint32_t) 0x00004000UL)
#define SCB_SHCSR_R_BUSFAULTPENDED_BIT    (14UL)
#define SCB_SHCSR_R_BUSFAULTPENDED_NOPEND    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_R_BUSFAULTPENDED_PEND    ((uint32_t) 0x00004000UL)

#define SCB_SHCSR_BUSFAULTPENDED_MASK    ((uint32_t) 0x00000001UL)
#define SCB_SHCSR_BUSFAULTPENDED_NOPEND    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_BUSFAULTPENDED_PEND    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_SVCALLPENDED_MASK    ((uint32_t) 0x00008000UL)
#define SCB_SHCSR_R_SVCALLPENDED_BIT    (15UL)
#define SCB_SHCSR_R_SVCALLPENDED_NOPEND    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_R_SVCALLPENDED_PEND    ((uint32_t) 0x00008000UL)

#define SCB_SHCSR_SVCALLPENDED_MASK    ((uint32_t) 0x00000001UL)
#define SCB_SHCSR_SVCALLPENDED_NOPEND    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_SVCALLPENDED_PEND    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_MEMFAULTENA_MASK    ((uint32_t) 0x00010000UL)
#define SCB_SHCSR_R_MEMFAULTENA_BIT    (16UL)
#define SCB_SHCSR_R_MEMFAULTENA_DIS    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_R_MEMFAULTENA_EN    ((uint32_t) 0x00010000UL)

#define SCB_SHCSR_MEMFAULTENA_MASK    ((uint32_t) 0x00000001UL)
#define SCB_SHCSR_MEMFAULTENA_DIS    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_MEMFAULTENA_EN    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_BUSFAULTENA_MASK    ((uint32_t) 0x00020000UL)
#define SCB_SHCSR_R_BUSFAULTENA_BIT    (17UL)
#define SCB_SHCSR_R_BUSFAULTENA_DIS    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_R_BUSFAULTENA_EN    ((uint32_t) 0x00020000UL)

#define SCB_SHCSR_BUSFAULTENA_MASK    ((uint32_t) 0x00000001UL)
#define SCB_SHCSR_BUSFAULTENA_DIS    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_BUSFAULTENA_EN    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_USGFAULTENA_MASK    ((uint32_t) 0x00040000UL)
#define SCB_SHCSR_R_USGFAULTENA_BIT    (18UL)
#define SCB_SHCSR_R_USGFAULTENA_DIS    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_R_USGFAULTENA_EN    ((uint32_t) 0x00040000UL)

#define SCB_SHCSR_USGFAULTENA_MASK    ((uint32_t) 0x00000001UL)
#define SCB_SHCSR_USGFAULTENA_DIS    ((uint32_t) 0x00000000UL)
#define SCB_SHCSR_USGFAULTENA_EN    ((uint32_t) 0x00000001UL)
/*----------*/

/********************************************************************************************/
/************************************* 13 CFSR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_CFSR_R_IACCVIOL_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_R_IACCVIOL_BIT    (0UL)
#define SCB_CFSR_R_IACCVIOL_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_IACCVIOL_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_R_IACCVIOL_CLEAR    ((uint32_t) 0x00000001UL)

#define SCB_CFSR_IACCVIOL_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_IACCVIOL_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_IACCVIOL_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_IACCVIOL_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_DACCVIOL_MASK    ((uint32_t) 0x00000002UL)
#define SCB_CFSR_R_DACCVIOL_BIT    (1UL)
#define SCB_CFSR_R_DACCVIOL_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_DACCVIOL_OCCUR    ((uint32_t) 0x00000002UL)
#define SCB_CFSR_R_DACCVIOL_CLEAR    ((uint32_t) 0x00000002UL)

