InDeviceMex/TM4C123/TM4C123_ACOMP/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_CFSR_DACCVIOL_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_DACCVIOL_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_DACCVIOL_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_DACCVIOL_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_MUNSTKERR_MASK    ((uint32_t) 0x00000008UL)
#define SCB_CFSR_R_MUNSTKERR_BIT    (3UL)
#define SCB_CFSR_R_MUNSTKERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_MUNSTKERR_OCCUR    ((uint32_t) 0x00000008UL)
#define SCB_CFSR_R_MUNSTKERR_CLEAR    ((uint32_t) 0x00000008UL)

#define SCB_CFSR_MUNSTKERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_MUNSTKERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_MUNSTKERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_MUNSTKERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_MSTKERR_MASK    ((uint32_t) 0x00000010UL)
#define SCB_CFSR_R_MSTKERR_BIT    (4UL)
#define SCB_CFSR_R_MSTKERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_MSTKERR_OCCUR    ((uint32_t) 0x00000010UL)
#define SCB_CFSR_R_MSTKERR_CLEAR    ((uint32_t) 0x00000010UL)

#define SCB_CFSR_MSTKERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_MSTKERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_MSTKERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_MSTKERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_MLSPERR_MASK    ((uint32_t) 0x00000020UL)
#define SCB_CFSR_R_MLSPERR_BIT    (5UL)
#define SCB_CFSR_R_MLSPERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_MLSPERR_OCCUR    ((uint32_t) 0x00000020UL)
#define SCB_CFSR_R_MLSPERR_CLEAR    ((uint32_t) 0x00000020UL)

#define SCB_CFSR_MLSPERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_MLSPERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_MLSPERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_MLSPERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_MMARVALID_MASK    ((uint32_t) 0x00000080UL)
#define SCB_CFSR_R_MMARVALID_BIT    (7UL)
#define SCB_CFSR_R_MMARVALID_NOVALID    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_MMARVALID_VALID    ((uint32_t) 0x00000080UL)
#define SCB_CFSR_R_MMARVALID_CLEAR    ((uint32_t) 0x00000080UL)

#define SCB_CFSR_MMARVALID_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_MMARVALID_NOVALID    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_MMARVALID_VALID    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_MMARVALID_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_IBUSERR_MASK    ((uint32_t) 0x00000100UL)
#define SCB_CFSR_R_IBUSERR_BIT    (8UL)
#define SCB_CFSR_R_IBUSERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_IBUSERR_OCCUR    ((uint32_t) 0x00000100UL)
#define SCB_CFSR_R_IBUSERR_CLEAR    ((uint32_t) 0x00000100UL)

#define SCB_CFSR_IBUSERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_IBUSERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_IBUSERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_IBUSERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_PRECISERR_MASK    ((uint32_t) 0x00000200UL)
#define SCB_CFSR_R_PRECISERR_BIT    (9UL)
#define SCB_CFSR_R_PRECISERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_PRECISERR_OCCUR    ((uint32_t) 0x00000200UL)
#define SCB_CFSR_R_PRECISERR_CLEAR    ((uint32_t) 0x00000200UL)

#define SCB_CFSR_PRECISERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_PRECISERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_PRECISERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_PRECISERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_IMPRECISERR_MASK    ((uint32_t) 0x00000400UL)
#define SCB_CFSR_R_IMPRECISERR_BIT    (10UL)
#define SCB_CFSR_R_IMPRECISERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_IMPRECISERR_OCCUR    ((uint32_t) 0x00000400UL)
#define SCB_CFSR_R_IMPRECISERR_CLEAR    ((uint32_t) 0x00000400UL)

#define SCB_CFSR_IMPRECISERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_IMPRECISERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_IMPRECISERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_IMPRECISERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_UNSTKERR_MASK    ((uint32_t) 0x00000800UL)
#define SCB_CFSR_R_UNSTKERR_BIT    (11UL)
#define SCB_CFSR_R_UNSTKERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_UNSTKERR_OCCUR    ((uint32_t) 0x00000800UL)
#define SCB_CFSR_R_UNSTKERR_CLEAR    ((uint32_t) 0x00000800UL)

#define SCB_CFSR_UNSTKERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_UNSTKERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_UNSTKERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_UNSTKERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_STKERR_MASK    ((uint32_t) 0x00001000UL)
#define SCB_CFSR_R_STKERR_BIT    (12UL)
#define SCB_CFSR_R_STKERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_STKERR_OCCUR    ((uint32_t) 0x00001000UL)
#define SCB_CFSR_R_STKERR_CLEAR    ((uint32_t) 0x00001000UL)

#define SCB_CFSR_STKERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_STKERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_STKERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_STKERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_LSPERR_MASK    ((uint32_t) 0x00002000UL)
#define SCB_CFSR_R_LSPERR_BIT    (13UL)
#define SCB_CFSR_R_LSPERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_LSPERR_OCCUR    ((uint32_t) 0x00002000UL)
#define SCB_CFSR_R_LSPERR_CLEAR    ((uint32_t) 0x00002000UL)

#define SCB_CFSR_LSPERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_LSPERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_LSPERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_LSPERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_BFARVALID_MASK    ((uint32_t) 0x00008000UL)
#define SCB_CFSR_R_BFARVALID_BIT    (15UL)
#define SCB_CFSR_R_BFARVALID_NOVALID    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_BFARVALID_VALID    ((uint32_t) 0x00008000UL)
#define SCB_CFSR_R_BFARVALID_CLEAR    ((uint32_t) 0x00008000UL)

#define SCB_CFSR_BFARVALID_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_BFARVALID_NOVALID    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_BFARVALID_VALID    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_BFARVALID_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_UNDEFINSTR_MASK    ((uint32_t) 0x00010000UL)
#define SCB_CFSR_R_UNDEFINSTR_BIT    (16UL)
#define SCB_CFSR_R_UNDEFINSTR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_UNDEFINSTR_OCCUR    ((uint32_t) 0x00010000UL)
#define SCB_CFSR_R_UNDEFINSTR_CLEAR    ((uint32_t) 0x00010000UL)

#define SCB_CFSR_UNDEFINSTR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_UNDEFINSTR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_UNDEFINSTR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_UNDEFINSTR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_INVSTATE_MASK    ((uint32_t) 0x00020000UL)
#define SCB_CFSR_R_INVSTATE_BIT    (17UL)
#define SCB_CFSR_R_INVSTATE_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_INVSTATE_OCCUR    ((uint32_t) 0x00020000UL)
#define SCB_CFSR_R_INVSTATE_CLEAR    ((uint32_t) 0x00020000UL)

