InDeviceMex/TM4C123/TM4C123_ACOMP/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_CFSR_INVSTATE_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_INVSTATE_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_INVSTATE_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_INVSTATE_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_INVPC_MASK    ((uint32_t) 0x00040000UL)
#define SCB_CFSR_R_INVPC_BIT    (18UL)
#define SCB_CFSR_R_INVPC_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_INVPC_OCCUR    ((uint32_t) 0x00040000UL)
#define SCB_CFSR_R_INVPC_CLEAR    ((uint32_t) 0x00040000UL)

#define SCB_CFSR_INVPC_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_INVPC_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_INVPC_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_INVPC_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_NOCP_MASK    ((uint32_t) 0x00080000UL)
#define SCB_CFSR_R_NOCP_BIT    (19UL)
#define SCB_CFSR_R_NOCP_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_NOCP_OCCUR    ((uint32_t) 0x00080000UL)
#define SCB_CFSR_R_NOCP_CLEAR    ((uint32_t) 0x00080000UL)

#define SCB_CFSR_NOCP_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_NOCP_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_NOCP_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_NOCP_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_UNALIGNED_MASK    ((uint32_t) 0x01000000UL)
#define SCB_CFSR_R_UNALIGNED_BIT    (24UL)
#define SCB_CFSR_R_UNALIGNED_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_UUNALIGNED_OCCUR    ((uint32_t) 0x01000000UL)
#define SCB_CFSR_R_UNALIGNED_CLEAR    ((uint32_t) 0x01000000UL)

#define SCB_CFSR_UNALIGNED_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_UNALIGNED_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_UNALIGNED_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_UNALIGNED_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_DIVBYZERO_MASK    ((uint32_t) 0x02000000UL)
#define SCB_CFSR_R_DIVBYZERO_BIT    (25UL)
#define SCB_CFSR_R_DIVBYZERO_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_R_DIVBYZERO_OCCUR    ((uint32_t) 0x02000000UL)
#define SCB_CFSR_R_DIVBYZERO_CLEAR    ((uint32_t) 0x02000000UL)

#define SCB_CFSR_DIVBYZERO_MASK    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_DIVBYZERO_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_CFSR_DIVBYZERO_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_CFSR_DIVBYZERO_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/********************************************************************************************/
/************************************* 13_1 UCFSR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_UCFSR_R_UNDEFINSTR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_UCFSR_R_UNDEFINSTR_BIT    (0UL)
#define SCB_UCFSR_R_UNDEFINSTR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_UCFSR_R_UNDEFINSTR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_UCFSR_R_UNDEFINSTR_CLEAR    ((uint32_t) 0x00000001UL)

#define SCB_UCFSR_UNDEFINSTR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_UCFSR_UNDEFINSTR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_UCFSR_UNDEFINSTR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_UCFSR_UNDEFINSTR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_UCFSR_R_INVSTATE_MASK    ((uint32_t) 0x00000002UL)
#define SCB_UCFSR_R_INVSTATE_BIT    (1UL)
#define SCB_UCFSR_R_INVSTATE_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_UCFSR_R_INVSTATE_OCCUR    ((uint32_t) 0x00000002UL)
#define SCB_UCFSR_R_INVSTATE_CLEAR    ((uint32_t) 0x00000002UL)

#define SCB_UCFSR_INVSTATE_MASK    ((uint32_t) 0x00000001UL)
#define SCB_UCFSR_INVSTATE_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_UCFSR_INVSTATE_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_UCFSR_INVSTATE_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_UCFSR_R_INVPC_MASK    ((uint32_t) 0x00000004UL)
#define SCB_UCFSR_R_INVPC_BIT    (2UL)
#define SCB_UCFSR_R_INVPC_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_UCFSR_R_INVPC_OCCUR    ((uint32_t) 0x00000004UL)
#define SCB_UCFSR_R_INVPC_CLEAR    ((uint32_t) 0x00000004UL)

#define SCB_UCFSR_INVPC_MASK    ((uint32_t) 0x00000001UL)
#define SCB_UCFSR_INVPC_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_UCFSR_INVPC_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_UCFSR_INVPC_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_UCFSR_R_NOCP_MASK    ((uint32_t) 0x00000008UL)
#define SCB_UCFSR_R_NOCP_BIT    (3UL)
#define SCB_UCFSR_R_NOCP_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_UCFSR_R_NOCP_OCCUR    ((uint32_t) 0x00000008UL)
#define SCB_UCFSR_R_NOCP_CLEAR    ((uint32_t) 0x00000008UL)

#define SCB_UCFSR_NOCP_MASK    ((uint32_t) 0x00000001UL)
#define SCB_UCFSR_NOCP_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_UCFSR_NOCP_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_UCFSR_NOCP_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_UCFSR_R_UNALIGNED_MASK    ((uint32_t) 0x00000100UL)
#define SCB_UCFSR_R_UNALIGNED_BIT    (8UL)
#define SCB_UCFSR_R_UNALIGNED_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_UCFSR_R_UUNALIGNED_OCCUR    ((uint32_t) 0x00000100UL)
#define SCB_UCFSR_R_UNALIGNED_CLEAR    ((uint32_t) 0x00000100UL)

#define SCB_UCFSR_UNALIGNED_MASK    ((uint32_t) 0x00000001UL)
#define SCB_UCFSR_UNALIGNED_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_UCFSR_UNALIGNED_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_UCFSR_UNALIGNED_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_UCFSR_R_DIVBYZERO_MASK    ((uint32_t) 0x00000200UL)
#define SCB_UCFSR_R_DIVBYZERO_BIT    (9UL)
#define SCB_UCFSR_R_DIVBYZERO_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_UCFSR_R_DIVBYZERO_OCCUR    ((uint32_t) 0x00000200UL)
#define SCB_UCFSR_R_DIVBYZERO_CLEAR    ((uint32_t) 0x00000200UL)

#define SCB_UCFSR_DIVBYZERO_MASK    ((uint32_t) 0x00000001UL)
#define SCB_UCFSR_DIVBYZERO_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_UCFSR_DIVBYZERO_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_UCFSR_DIVBYZERO_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

