InDeviceMex/TM4C123/TM4C123_ACOMP/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
/********************************************************************************************/
/************************************* 13_2 BCFSR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_BCFSR_R_IBUSERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_BCFSR_R_IBUSERR_BIT    (0UL)
#define SCB_BCFSR_R_IBUSERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_BCFSR_R_IBUSERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_BCFSR_R_IBUSERR_CLEAR    ((uint32_t) 0x00000001UL)

#define SCB_BCFSR_IBUSERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_BCFSR_IBUSERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_BCFSR_IBUSERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_BCFSR_IBUSERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_BCFSR_R_PRECISERR_MASK    ((uint32_t) 0x00000002UL)
#define SCB_BCFSR_R_PRECISERR_BIT    (1UL)
#define SCB_BCFSR_R_PRECISERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_BCFSR_R_PRECISERR_OCCUR    ((uint32_t) 0x00000002UL)
#define SCB_BCFSR_R_PRECISERR_CLEAR    ((uint32_t) 0x00000002UL)

#define SCB_BCFSR_PRECISERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_BCFSR_PRECISERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_BCFSR_PRECISERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_BCFSR_PRECISERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_BCFSR_R_IMPRECISERR_MASK    ((uint32_t) 0x00000004UL)
#define SCB_BCFSR_R_IMPRECISERR_BIT    (2UL)
#define SCB_BCFSR_R_IMPRECISERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_BCFSR_R_IMPRECISERR_OCCUR    ((uint32_t) 0x00000004UL)
#define SCB_BCFSR_R_IMPRECISERR_CLEAR    ((uint32_t) 0x00000004UL)

#define SCB_BCFSR_IMPRECISERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_BCFSR_IMPRECISERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_BCFSR_IMPRECISERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_BCFSR_IMPRECISERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_BCFSR_R_UNSTKERR_MASK    ((uint32_t) 0x00000008UL)
#define SCB_BCFSR_R_UNSTKERR_BIT    (3UL)
#define SCB_BCFSR_R_UNSTKERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_BCFSR_R_UNSTKERR_OCCUR    ((uint32_t) 0x00000008UL)
#define SCB_BCFSR_R_UNSTKERR_CLEAR    ((uint32_t) 0x00000008UL)

#define SCB_BCFSR_UNSTKERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_BCFSR_UNSTKERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_BCFSR_UNSTKERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_BCFSR_UNSTKERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_BCFSR_R_STKERR_MASK    ((uint32_t) 0x00000010UL)
#define SCB_BCFSR_R_STKERR_BIT    (4UL)
#define SCB_BCFSR_R_STKERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_BCFSR_R_STKERR_OCCUR    ((uint32_t) 0x00000010UL)
#define SCB_BCFSR_R_STKERR_CLEAR    ((uint32_t) 0x00000010UL)

#define SCB_BCFSR_STKERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_BCFSR_STKERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_BCFSR_STKERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_BCFSR_STKERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_BCFSR_R_LSPERR_MASK    ((uint32_t) 0x00000020UL)
#define SCB_BCFSR_R_LSPERR_BIT    (5UL)
#define SCB_BCFSR_R_LSPERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_BCFSR_R_LSPERR_OCCUR    ((uint32_t) 0x00000020UL)
#define SCB_BCFSR_R_LSPERR_CLEAR    ((uint32_t) 0x00000020UL)

#define SCB_BCFSR_LSPERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_BCFSR_LSPERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_BCFSR_LSPERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_BCFSR_LSPERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_BCFSR_R_BFARVALID_MASK    ((uint32_t) 0x00000080UL)
#define SCB_BCFSR_R_BFARVALID_BIT    (7UL)
#define SCB_BCFSR_R_BFARVALID_NOVALID    ((uint32_t) 0x00000000UL)
#define SCB_BCFSR_R_BFARVALID_VALID    ((uint32_t) 0x00000080UL)
#define SCB_BCFSR_R_BFARVALID_CLEAR    ((uint32_t) 0x00000080UL)

#define SCB_BCFSR_BFARVALID_MASK    ((uint32_t) 0x00000001UL)
#define SCB_BCFSR_BFARVALID_NOVALID    ((uint32_t) 0x00000000UL)
#define SCB_BCFSR_BFARVALID_VALID    ((uint32_t) 0x00000001UL)
#define SCB_BCFSR_BFARVALID_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/********************************************************************************************/
/************************************* 13_3 MCFSR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_MCFSR_R_IACCVIOL_MASK    ((uint32_t) 0x00000001UL)
#define SCB_MCFSR_R_IACCVIOL_BIT    (0UL)
#define SCB_MCFSR_R_IACCVIOL_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_MCFSR_R_IACCVIOL_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_MCFSR_R_IACCVIOL_CLEAR    ((uint32_t) 0x00000001UL)

#define SCB_MCFSR_IACCVIOL_MASK    ((uint32_t) 0x00000001UL)
#define SCB_MCFSR_IACCVIOL_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_MCFSR_IACCVIOL_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_MCFSR_IACCVIOL_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_MCFSR_R_DACCVIOL_MASK    ((uint32_t) 0x00000002UL)
#define SCB_MCFSR_R_DACCVIOL_BIT    (1UL)
#define SCB_MCFSR_R_DACCVIOL_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_MCFSR_R_DACCVIOL_OCCUR    ((uint32_t) 0x00000002UL)
#define SCB_MCFSR_R_DACCVIOL_CLEAR    ((uint32_t) 0x00000002UL)

#define SCB_MCFSR_DACCVIOL_MASK    ((uint32_t) 0x00000001UL)
#define SCB_MCFSR_DACCVIOL_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_MCFSR_DACCVIOL_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_MCFSR_DACCVIOL_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_MCFSR_R_MUNSTKERR_MASK    ((uint32_t) 0x00000008UL)
#define SCB_MCFSR_R_MUNSTKERR_BIT    (3UL)
#define SCB_MCFSR_R_MUNSTKERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_MCFSR_R_MUNSTKERR_OCCUR    ((uint32_t) 0x00000008UL)
#define SCB_MCFSR_R_MUNSTKERR_CLEAR    ((uint32_t) 0x00000008UL)

#define SCB_MCFSR_MUNSTKERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_MCFSR_MUNSTKERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_MCFSR_MUNSTKERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_MCFSR_MUNSTKERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_MCFSR_R_MSTKERR_MASK    ((uint32_t) 0x00000010UL)
#define SCB_MCFSR_R_MSTKERR_BIT    (4UL)
#define SCB_MCFSR_R_MSTKERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_MCFSR_R_MSTKERR_OCCUR    ((uint32_t) 0x00000010UL)
#define SCB_MCFSR_R_MSTKERR_CLEAR    ((uint32_t) 0x00000010UL)

#define SCB_MCFSR_MSTKERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_MCFSR_MSTKERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_MCFSR_MSTKERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_MCFSR_MSTKERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_MCFSR_R_MLSPERR_MASK    ((uint32_t) 0x00000020UL)
#define SCB_MCFSR_R_MLSPERR_BIT    (5UL)
#define SCB_MCFSR_R_MLSPERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_MCFSR_R_MLSPERR_OCCUR    ((uint32_t) 0x00000020UL)
#define SCB_MCFSR_R_MLSPERR_CLEAR    ((uint32_t) 0x00000020UL)

#define SCB_MCFSR_MLSPERR_MASK    ((uint32_t) 0x00000001UL)
#define SCB_MCFSR_MLSPERR_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_MCFSR_MLSPERR_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_MCFSR_MLSPERR_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_MCFSR_R_MMARVALID_MASK    ((uint32_t) 0x00000080UL)
#define SCB_MCFSR_R_MMARVALID_BIT    (7UL)
#define SCB_MCFSR_R_MMARVALID_NOVALID    ((uint32_t) 0x00000000UL)
#define SCB_MCFSR_R_MMARVALID_VALID    ((uint32_t) 0x00000080UL)
#define SCB_MCFSR_R_MMARVALID_CLEAR    ((uint32_t) 0x00000080UL)

