InDeviceMex/TM4C123/TM4C123_ACOMP/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_MCFSR_MMARVALID_MASK    ((uint32_t) 0x00000001UL)
#define SCB_MCFSR_MMARVALID_NOVALID    ((uint32_t) 0x00000000UL)
#define SCB_MCFSR_MMARVALID_VALID    ((uint32_t) 0x00000001UL)
#define SCB_MCFSR_MMARVALID_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/********************************************************************************************/
/************************************* 14 HFSR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_HFSR_R_VECTTBL_MASK    ((uint32_t) 0x00000002UL)
#define SCB_HFSR_R_VECTTBL_BIT    (1UL)
#define SCB_HFSR_R_VECTTBL_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_HFSR_R_VECTTBL_OCCUR    ((uint32_t) 0x00000002UL)
#define SCB_HFSR_R_VECTTBL_CLEAR    ((uint32_t) 0x00000002UL)

#define SCB_HFSR_VECTTBL_MASK    ((uint32_t) 0x00000001UL)
#define SCB_HFSR_VECTTBL_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_HFSR_VECTTBL_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_HFSR_VECTTBL_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_HFSR_R_FORCED_MASK    ((uint32_t) 0x40000000UL)
#define SCB_HFSR_R_FORCED_BIT    (30UL)
#define SCB_HFSR_R_FORCED_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_HFSR_R_FORCED_OCCUR    ((uint32_t) 0x40000000UL)
#define SCB_HFSR_R_FORCED_CLEAR    ((uint32_t) 0x40000000UL)

#define SCB_HFSR_FORCED_MASK    ((uint32_t) 0x00000001UL)
#define SCB_HFSR_FORCED_NOOCCUR    ((uint32_t) 0x00000000UL)
#define SCB_HFSR_FORCED_OCCUR    ((uint32_t) 0x00000001UL)
#define SCB_HFSR_FORCED_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_HFSR_R_DEBUGEVT_MASK    ((uint32_t) 0x80000000UL)
#define SCB_HFSR_R_DEBUGEVT_BIT    (31UL)

#define SCB_HFSR_DEBUGEVT_MASK    ((uint32_t) 0x1UL)
/*----------*/

/********************************************************************************************/
/************************************* 15 MMFAR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_MMFAR_R_ADDRESS_MASK    ((uint32_t) 0xFFFFFFFFUL)
#define SCB_MMFAR_R_ADDRESS_BIT    (0UL)

#define SCB_MMFAR_ADDRESS_MASK    ((uint32_t) 0xFFFFFFFFUL)
/*----------*/


/********************************************************************************************/
/************************************* 16 BFAR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_BFAR_R_ADDRESS_MASK    ((uint32_t) 0xFFFFFFFFUL)
#define SCB_BFAR_R_ADDRESS_BIT    (0UL)

#define SCB_BFAR_ADDRESS_MASK    ((uint32_t) 0xFFFFFFFFUL)
/*----------*/

/********************************************************************************************/
/************************************* 17 AFSR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_AFSR_R_IMPDEF_MASK    ((uint32_t) 0xFFFFFFFFUL)
#define SCB_AFSR_R_IMPDEF_BIT    (0UL)

#define SCB_AFSR_IMPDEF_MASK    ((uint32_t) 0xFFFFFFFFUL)
/*----------*/

/********************************************************************************************/
/************************************* 18 PFR0 ***********************************************/
/********************************************************************************************/

/********************************************************************************************/
/************************************* 19 PFR1 ***********************************************/
/********************************************************************************************/

/********************************************************************************************/
/************************************* 20 DFR0 ***********************************************/
/********************************************************************************************/

/********************************************************************************************/
/************************************* 21 AFR0 ***********************************************/
/********************************************************************************************/

/********************************************************************************************/
/************************************* 22 MMFR0 ***********************************************/
/********************************************************************************************/

/********************************************************************************************/
/************************************* 23 MMFR1 ***********************************************/
/********************************************************************************************/

/********************************************************************************************/
/************************************* 24 MMFR2 ***********************************************/
/********************************************************************************************/

/********************************************************************************************/
/************************************* 25 MMFR3 ***********************************************/
/********************************************************************************************/

/********************************************************************************************/
/************************************* 26 ISAR0 ***********************************************/
/********************************************************************************************/

/********************************************************************************************/
/************************************* 27 ISAR1 ***********************************************/
/********************************************************************************************/

/********************************************************************************************/
/************************************* 28 ISAR2 ***********************************************/
/********************************************************************************************/

/********************************************************************************************/
/************************************* 29 ISAR3 ***********************************************/
/********************************************************************************************/

/********************************************************************************************/
/************************************* 30 ISAR4 ***********************************************/
/********************************************************************************************/

#endif /* XDRIVER_MCU_DRIVER_HEADER_SCB_SCB_PERIPHERAL_SCB_REGISTER_SCB_REGISTERDEFINES_H_ */
